# Dossier 1:
10. 
```
Switch(config)#spanning-tree mode rapide-pvst 
SW1(config)#spanning-tree mode rapide-pvst 
SW2(config)#spanning-tree mode rapide-pvst 
SW3(config)#spanning-tree mode rapide-pvst 
```

11. 
```
SW1(config)#spanning-tree vlan 110,120 root primary 
SW1(config)#spanning-tree vlan 130,140 root secondary 
```

12. 
```
SW2(config)#spanning-tree vlan 130,140 root primary 
SW2(config)#spanning-tree vlan 110,120 root secondary 
```

 13. 
```
SW1(config)#interface vlan 199 
SW1(config-if)#ip address 172.30.1.121 255.255.255.248 
```

14. 
 ```
Siege(config)#line vty 0 3 
Siege(config-line)#password aer0pwd 
Siege(config-line)#login 
Siege(config)#line vty 4 9 
Siege(config-line)#password sp@cepwd 
Siege(config-line)#login 
```

15.
``` 
Siege(config)#ip access-list standard 1 
Siege(config-std-nacl)# permit 172.30.0.126 0.0.0.7 
Siege(config)#line vty 0 3 
Siege(config-line)#password aer0pwd      
Siege(config-line)#access-class 1 in 
Siege(config)#line vty 4 9 
Siege(config-line)#password sp@cepwd 
Siege(config-line)#access-class 1 in 
```

16.
```
Siege(config)#int g0/0.111 
Siege(config-subif)#encapsulation Dot1q 111 
Siege(config-subif)#ip address 172.30.0.33 255.255.255.224 
Siege(config)#int g0/0.122 
Siege(config-subif)#encapsulation Dot1q 122 
Siege(config-subif)#ip address 172.30.0.1 255.255.255.224 
Siege(config)#int g0/0.133 
Siege(config-subif)#encapsulation Dot1q 133 
Siege(config-subif)#ip address 172.30.0.65 255.255.255.224 
Siege(config)#int g0/0.144 
Siege(config-subif)#encapsulation Dot1q 144 
Siege(config-subif)#ip address 172.30.0.113 255.255.255.248
```

19.   
```
Siege(config)#ip route 0.0.0.0 0.0.0.0 s0/0 
Atelier1(config)#ip route 0.0.0.0 0.0.0.0 s0/0  
Atelier2(config)#ip route 0.0.0.0 0.0.0.0 s0/0          
UTT(config)#ip route 0.0.0.0 0.0.0.0 s0/0 
```

20.  
```
siege(config)# ip access-list extended 1 
siege(config-ext-nacl)# permit udp any host 172.30.0.99 eq 53 
siege(config-ext-nacl)# permit tcp any 172.30.0.98 0.0.0.15 eq 389 
siege(config-ext-nacl)# permit tcp any 172.30.0.98 0.0.0.15 eq 3268 
siege(config-ext-nacl)# permit ip 172.30.0.224 0.0.0.15 172.30.0.100 0.0.0.15 eq 80 
siege(config-ext-nacl)# permit ip 172.30.0.32 0.0.0.31 172.30.0.100 0.0.0.15 eq 80 
siege(config-ext-nacl)# permit ip 172.30.0.0 0.0.0.31 172.30.0.100 0.0.0.15 eq 80 
siege(config-ext-nacl)# permit ip 172.30.0.112 0.0.0.7 172.30.0.100 0.0.0.15 eq 80 
siege(config-ext-nacl)# permit tcp 172.30.0.0 0.0.0.31 172.30.0.100 0.0.0.15 eq 443 
siege(config-ext-nacl)# permit tcp 172.30.0.112 0.0.0.7 172.30.0.100 0.0.0.15 eq 443 
siege(config-ext-nacl)# permit tcp 172.30.0.192 0.0.0.31 172.30.0.100 0.0.0.15 eq 8888 
siege(config-ext-nacl)# permit tcp 172.30.0.64 0.0.0.31 172.30.0.100 0.0.0.15 eq 8888 
siege(config)# interface g0/0 
siege(config-if)# ip access-group 1 out
```